services/search-service/tests/performance/search_scalability.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  TravelHub Search Service — JMeter Scalability Test Plan (HU023 PF-283)
  =========================================================================
  Validates: p95 response time < 800ms under concurrent load
  Two Thread Groups:
    1. Warm-up (10k SKUs catalog)  — 50 users, 30 s ramp, 120 s duration
    2. Peak load (30k SKUs catalog) — 100 users, 60 s ramp, 300 s duration

  Destinations used:  Cartagena, Bogotá, Medellín, Cancún, Madrid
  Dates:              check_in = today+5, check_out = today+9 (4 nights)

  How to run (from services/search-service/tests/performance/):
    jmeter -n -t search_scalability.jmx \
           -Jhost=localhost -Jport=8001 \
           -l results/run_$(date +%Y%m%d_%H%M%S).jtl \
           -e -o results/report_$(date +%Y%m%d_%H%M%S)
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="TravelHub Search Scalability" enabled="true">
      <stringProp name="TestPlan.comments">HU023 — p95 &lt; 800ms @ 30k SKUs</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">${__P(port,8001)}</stringProp>
          </elementProp>
          <elementProp name="check_in" elementType="Argument">
            <stringProp name="Argument.name">check_in</stringProp>
            <stringProp name="Argument.value">${__time(yyyy-MM-dd,)}</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ═══════════════════════════════════════════════════════════════════
           Thread Group 1 — Warm-up / 10k SKUs catalog
           50 concurrent users, 30s ramp-up, 120s sustained
           ═══════════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="TG1: Warm-up (10k SKUs)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(tg1_threads,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(tg1_ramp,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(tg1_duration,120)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- CSV Data Set for destinations -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet"
                    testname="Destinations CSV" enabled="true">
          <stringProp name="filename">destinations.csv</stringProp>
          <stringProp name="variableNames">destination,adults,rooms</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /api/v1/search/properties" enabled="true">
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/search/properties</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="destination" elementType="HTTPArgument">
                <stringProp name="Argument.name">destination</stringProp>
                <stringProp name="Argument.value">${destination}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="check_in" elementType="HTTPArgument">
                <stringProp name="Argument.name">check_in</stringProp>
                <stringProp name="Argument.value">${__timeShift(yyyy-MM-dd,,P5D,,)}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="check_out" elementType="HTTPArgument">
                <stringProp name="Argument.name">check_out</stringProp>
                <stringProp name="Argument.value">${__timeShift(yyyy-MM-dd,,P9D,,)}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="adults" elementType="HTTPArgument">
                <stringProp name="Argument.name">adults</stringProp>
                <stringProp name="Argument.value">${adults}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="rooms" elementType="HTTPArgument">
                <stringProp name="Argument.name">rooms</stringProp>
                <stringProp name="Argument.value">${rooms}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Assert HTTP 200 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">2</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Assert p95 < 800ms via Duration Assertion on each sample -->
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                             testname="Assert p95 &lt; 800ms" enabled="true">
            <stringProp name="DurationAssertion.duration">800</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <!-- Think time: 1-3 seconds between requests -->
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer"
                            testname="Think Time 1-3s" enabled="true">
          <stringProp name="ConstantTimer.delay">1000</stringProp>
          <stringProp name="RandomTimer.range">2000</stringProp>
        </UniformRandomTimer>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════════
           Thread Group 2 — Peak load / 30k SKUs catalog
           100 concurrent users, 60s ramp-up, 300s sustained
           ═══════════════════════════════════════════════════════════════════ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="TG2: Peak Load (30k SKUs)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(tg2_threads,100)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(tg2_ramp,60)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(tg2_duration,300)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(tg2_delay,120)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet"
                    testname="Destinations CSV TG2" enabled="true">
          <stringProp name="filename">destinations.csv</stringProp>
          <stringProp name="variableNames">destination,adults,rooms</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="GET /api/v1/search/properties" enabled="true">
          <stringProp name="HTTPSampler.domain">${host}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/search/properties</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="destination" elementType="HTTPArgument">
                <stringProp name="Argument.name">destination</stringProp>
                <stringProp name="Argument.value">${destination}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="check_in" elementType="HTTPArgument">
                <stringProp name="Argument.name">check_in</stringProp>
                <stringProp name="Argument.value">${__timeShift(yyyy-MM-dd,,P5D,,)}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="check_out" elementType="HTTPArgument">
                <stringProp name="Argument.name">check_out</stringProp>
                <stringProp name="Argument.value">${__timeShift(yyyy-MM-dd,,P9D,,)}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="adults" elementType="HTTPArgument">
                <stringProp name="Argument.name">adults</stringProp>
                <stringProp name="Argument.value">${adults}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
              <elementProp name="rooms" elementType="HTTPArgument">
                <stringProp name="Argument.name">rooms</stringProp>
                <stringProp name="Argument.value">${rooms}</stringProp>
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">2</intProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                             testname="Assert p95 &lt; 800ms" enabled="true">
            <stringProp name="DurationAssertion.duration">800</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer"
                            testname="Think Time 1-3s" enabled="true">
          <stringProp name="ConstantTimer.delay">1000</stringProp>
          <stringProp name="RandomTimer.range">2000</stringProp>
        </UniformRandomTimer>
        <hashTree/>
      </hashTree>

      <!-- ═══════════════════════════════════════════════════════════════════
           Listeners
           ═══════════════════════════════════════════════════════════════════ -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                       testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/search_results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector"
                       testname="Statistics (percentiles)" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/search_stats.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>